# Devtools Kit – Casks
#
# Core development environment: editors, containers, terminals, API tools.
# Use case: Machines where you write code.

# ===================================================================
# Browsers
# ===================================================================

cask "firefox-developer-edition"       # Firefox for developers

# ===================================================================
# Terminals
# ===================================================================

cask "iterm2"                          # Terminal emulator
cask "warp"                            # AI-powered terminal

# ===================================================================
# Editors
# ===================================================================

cask "sublime-text"                    # Text editor
cask "visual-studio-code"              # Microsoft code editor
cask "cursor"                          # AI-first code editor
cask "claude-code"                     # AI code assistant
# cask "zed"                           # High-performance editor

# ===================================================================
# JetBrains
# ===================================================================

cask "jetbrains-toolbox"               # JetBrains IDE manager

# ===================================================================
# Git Clients
# ===================================================================

cask "github"                          # GitHub Desktop
cask "sublime-merge"                   # Git client

# ===================================================================
# API & HTTP Tools
# ===================================================================

cask "httpie"                          # HTTP client (GUI)
cask "postman"                         # API development platform
cask "proxyman"                        # HTTP debugging proxy

# ===================================================================
# Database Tools
# ===================================================================

cask "dbngin"                          # Database version manager
cask "tableplus"                       # Database GUI client

# ===================================================================
# Utilities
# ===================================================================

cask "balenaetcher"                    # USB/SD image flasher
cask "devutils"                        # Developer utilities
cask "utm"                             # Virtual machine host

# ===================================================================
# Mac App Store
# ===================================================================

mas "CodeRunner", id: 955297617        # Multi-language code editor
mas "Icon Set Creator", id: 452747075  # App icon generator
mas "Amphetamine", id: 937984704       # Prevent sleep
mas "Pastel", id: 413897608          # Color palette manager
