# Productivity Kit – Casks
#
# Browsers, communication, task management, and writing tools.
# Use case: Personal and work laptops.

# ===================================================================
# Browsers
# ===================================================================

cask "firefox"                         # Mozilla browser
cask "firefox-developer-edition"       # Firefox for developers
cask "google-chrome"                   # Google browser
cask "microsoft-edge"                  # Microsoft browser

# ===================================================================
# Communication
# ===================================================================

cask "discord"                         # Community chat
cask "slack"                           # Team messaging
cask "whatsapp"                        # Personal messaging
cask "zoom"                            # Video conferencing

# ===================================================================
# Tasks & Calendar
# ===================================================================

cask "fantastical"                     # Calendar app
cask "thingsmacsandboxhelper"          # Things helper
# cask "todoist"                         # Task management
# cask "trello"                          # Kanban boards

# ===================================================================
# Writing
# ===================================================================

cask "grammarly-desktop"               # Writing assistant
cask "markedit"                        # Markdown editor
# cask "textexpander"                    # Text expansion

# ===================================================================
# Media
# ===================================================================

cask "screenflow"                      # Screen recording
cask "spotify"                         # Music streaming
cask "vlc"                             # Media player

# ===================================================================
# AI
# ===================================================================

cask "claude"                          # Anthropic AI assistant

# ===================================================================
# Microsoft Office (Personal machines only)
# ===================================================================
# Uncomment on personal machines where Office is not enterprise-deployed
#
# cask "microsoft-excel"               # Spreadsheets
# cask "microsoft-onenote"             # Note taking
# cask "microsoft-outlook"             # Email client
# cask "microsoft-powerpoint"          # Presentations
# cask "microsoft-teams"               # Team collaboration
# cask "microsoft-word"                # Word processing
# cask "onedrive"                      # Cloud storage
